{
  "_name_or_path": "dbmdz/bert-base-turkish-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Alternaria Meyve Lekesi",
    "1": "Antraknoz (Colletotrichum spp.)",
    "2": "A\u015f\u0131r\u0131 Sulamaya Ba\u011fl\u0131 Bozulmalar",
    "3": "Bakteriyel Kanser (Clavibacter michiganensis)",
    "4": "Bakteriyel Leke (Xanthomonas spp.)",
    "5": "Bakteriyel Solgunluk (Ralstonia solanacearum)",
    "6": "Besin Noksanl\u0131klar\u0131",
    "7": "Beyaz Sinek (Bemisia tabaci)",
    "8": "Botrytis (Gri K\u00fcf)",
    "9": "Cladosporium Yaprak K\u00fcf\u00fc",
    "10": "Domates Fitoplazma (C\u00fccele\u015fme) Hastal\u0131\u011f\u0131",
    "11": "Domates Halkal\u0131 Leke Vir\u00fcs\u00fc",
    "12": "Domates Lekeli Solgunluk Vir\u00fcs\u00fc (TSWV)",
    "13": "Domates Mozaik Vir\u00fcs\u00fc (ToMV)",
    "14": "Domates Sar\u0131 Yaprak K\u0131v\u0131rc\u0131kl\u0131k Vir\u00fcs\u00fc (TYLCV)",
    "15": "Domates \u00c7al\u0131la\u015fma Vir\u00fcs\u00fc",
    "16": "Erken Yaprak Yan\u0131kl\u0131\u011f\u0131 (Alternaria solani)",
    "17": "Fusarium Solgunlu\u011fu",
    "18": "Ge\u00e7 Yaprak Yan\u0131kl\u0131\u011f\u0131 (Phytophthora infestans)",
    "19": "G\u00fcne\u015f Yan\u0131kl\u0131\u011f\u0131",
    "20": "K\u00fclleme (Leveillula taurica)",
    "21": "K\u0131rm\u0131z\u0131 \u00d6r\u00fcmcek (Tetranychus urticae)",
    "22": "Meyve \u00c7atlamas\u0131",
    "23": "Pythium K\u00f6k \u00c7\u00fcr\u00fckl\u00fc\u011f\u00fc",
    "24": "Rhizoctonia K\u00f6k \u00c7\u00fcr\u00fckl\u00fc\u011f\u00fc",
    "25": "Sclerotinia G\u00f6vde \u00c7\u00fcr\u00fckl\u00fc\u011f\u00fc",
    "26": "Septoria Yaprak Lekesi",
    "27": "Tomato Brown Rugose Fruit Virus (ToBRFV)",
    "28": "Tomato Chlorosis Virus (ToCV)",
    "29": "Verticillium Solgunlu\u011fu"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Alternaria Meyve Lekesi": 0,
    "Antraknoz (Colletotrichum spp.)": 1,
    "A\u015f\u0131r\u0131 Sulamaya Ba\u011fl\u0131 Bozulmalar": 2,
    "Bakteriyel Kanser (Clavibacter michiganensis)": 3,
    "Bakteriyel Leke (Xanthomonas spp.)": 4,
    "Bakteriyel Solgunluk (Ralstonia solanacearum)": 5,
    "Besin Noksanl\u0131klar\u0131": 6,
    "Beyaz Sinek (Bemisia tabaci)": 7,
    "Botrytis (Gri K\u00fcf)": 8,
    "Cladosporium Yaprak K\u00fcf\u00fc": 9,
    "Domates Fitoplazma (C\u00fccele\u015fme) Hastal\u0131\u011f\u0131": 10,
    "Domates Halkal\u0131 Leke Vir\u00fcs\u00fc": 11,
    "Domates Lekeli Solgunluk Vir\u00fcs\u00fc (TSWV)": 12,
    "Domates Mozaik Vir\u00fcs\u00fc (ToMV)": 13,
    "Domates Sar\u0131 Yaprak K\u0131v\u0131rc\u0131kl\u0131k Vir\u00fcs\u00fc (TYLCV)": 14,
    "Domates \u00c7al\u0131la\u015fma Vir\u00fcs\u00fc": 15,
    "Erken Yaprak Yan\u0131kl\u0131\u011f\u0131 (Alternaria solani)": 16,
    "Fusarium Solgunlu\u011fu": 17,
    "Ge\u00e7 Yaprak Yan\u0131kl\u0131\u011f\u0131 (Phytophthora infestans)": 18,
    "G\u00fcne\u015f Yan\u0131kl\u0131\u011f\u0131": 19,
    "K\u00fclleme (Leveillula taurica)": 20,
    "K\u0131rm\u0131z\u0131 \u00d6r\u00fcmcek (Tetranychus urticae)": 21,
    "Meyve \u00c7atlamas\u0131": 22,
    "Pythium K\u00f6k \u00c7\u00fcr\u00fckl\u00fc\u011f\u00fc": 23,
    "Rhizoctonia K\u00f6k \u00c7\u00fcr\u00fckl\u00fc\u011f\u00fc": 24,
    "Sclerotinia G\u00f6vde \u00c7\u00fcr\u00fckl\u00fc\u011f\u00fc": 25,
    "Septoria Yaprak Lekesi": 26,
    "Tomato Brown Rugose Fruit Virus (ToBRFV)": 27,
    "Tomato Chlorosis Virus (ToCV)": 28,
    "Verticillium Solgunlu\u011fu": 29
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.40.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 32000
}
